# == BREWS ==

# basic *nix programs
brew "coreutils"
brew "iproute2mac"
brew "bash"
brew "git"

# neovim
brew "neovim"

# gpg stuff
brew "pinentry"
brew "gnupg"

# iperf3
brew "iperf3"

# cool apps
brew "fastfetch"
brew "lazygit"
brew "ripgrep"
brew "htop"
brew "wget"
brew "node"
brew "fzf"
brew "bat"

brew "aftman"
brew "stylua"
brew "lune"

# == CASKS ==

# browsers
cask "orion"
cask "chromium"

cask "ghostty"
cask "orbstack"
cask "qbittorrent"
cask "raycast"
